<?php

/***
 * Файл содержит данные о платных дорогах трасы М-1
 */


# Индекс номер группы -1 значение цена за проезд
$price = [ 150, 180, 220, 370 ];
# Индексы номер недели -1
$prices = [
    $price,$price,$price,$price,$price,$price,$price
];

return [
    [
        "location" => "55.600250, 36.980265",
        "roadside" => "55.600431, 36.980196",
        "name" => "ПВП 46 КМ",
        "track" => [
            "name" => "M-1 Белорусь",
            // На каком километре дороги расположен терминал
            "terminal" => 46,
            "start" => "33",
            "end" => "66"
        ],
        "prices" => $prices
    ],
    [
        "location" => "55.600125, 36.980347",
        "roadside" => "55.599683, 36.980564",
        "name" => "ПВП 46 КМ",
        "track" => [
            "name" => "M-1 Белорусь",
            "start" => "66",
            "end" => "33"
        ],
        "prices" => $prices
    ]
];
